{
  "backend/main.mo": "Motoko canister implementing a public contact form submission endpoint and an admin-only query to retrieve submissions, with access control and timestamp-based sorting.",
  "feature_evidence.json": "Feature evidence report describing completed frontend UI/image updates for branding, hero, applications sections, and asset handling, with referenced files and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend components, sections, hooks, and configuration files used in the SKYRA landing page.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme CSS variables, color palette, and base styles for consistent UI surfaces and states.",
  "frontend/index.html": "HTML entry point for the frontend SPA, defining the root mount element and loading the React application.",
  "frontend/src/App.tsx": "Root React component that renders the Skyra landing page container.",
  "frontend/src/components/skyra/ApplicationsSection.tsx": "Applications grid section displaying six urban use cases with distinct images, hover effects, and descriptive text.",
  "frontend/src/components/skyra/AQIScienceExplainerSection.tsx": "Interactive AQI explainer section with slider-driven AQI categories, health guidance, and informational cards explaining air quality science.",
  "frontend/src/components/skyra/BottomCTASection.tsx": "Bottom call-to-action section prompting partnership and embedding the contact form within a styled container.",
  "frontend/src/components/skyra/CaseStudySection.tsx": "Case study section presenting structured deployment details and outcomes using icon-labeled data cards.",
  "frontend/src/components/skyra/ContactForm.tsx": "Implements a controlled contact inquiry form with validation and submission via a custom hook, handling loading, success, and error states. Displays a success confirmation view and resets form data on successful submission.",
  "frontend/src/components/skyra/Footer.tsx": "Renders the site footer with branding, tagline, social media links (LinkedIn and X), and a copyright notice with an external credit link.",
  "frontend/src/components/skyra/FutureVisionSection.tsx": "Displays a marketing section outlining SKYRA’s future vision with three strategic pillars, each represented by an icon, title, and description.",
  "frontend/src/components/skyra/HeroSection.tsx": "Provides the landing hero section with headline messaging, background imagery, and call-to-action buttons that smoothly scroll to other page sections.",
  "frontend/src/components/skyra/HowItWorksSection.tsx": "Explains the SKYRA photocatalytic process in a step-by-step visual layout and includes a tile system architecture diagram with labeled layers.",
  "frontend/src/components/skyra/ProblemSection.tsx": "Highlights key urban air quality problems using icon-based cards to frame the need for preventive, infrastructure-level solutions.",
  "frontend/src/components/skyra/ProductsSection.tsx": "Presents SKYRA product offerings grouped by application area (roads, transit, buildings) with descriptions and available variants.",
  "frontend/src/components/skyra/SustainabilityESGSection.tsx": "Showcases sustainability and ESG benefits of SKYRA through a list of environmental and operational impact points with icons and descriptions.",
  "frontend/src/components/skyra/TopNav.tsx": "Fixed top navigation bar that changes style on scroll and provides smooth-scrolling buttons to page sections and a call-to-action.",
  "frontend/src/components/skyra/WhatIsSkyraSection.tsx": "Landing page section explaining what Skyra is, with descriptive text and a product image laid out in a two-column grid.",
  "frontend/src/components/skyra/WhySkyraSection.tsx": "Section highlighting Skyra’s key benefits using a grid of icon-backed cards sourced from lucide-react.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on Internet Identity, handling authentication, admin initialization, and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useSubmitContactForm.ts": "React Query mutation hook that submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining Skyra brand color tokens, light/dark themes, base styles, and reusable component utility classes.",
  "frontend/src/main.tsx": "Frontend entry point that renders the app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/SkyraLandingPage.tsx": "Composes the full Skyra marketing landing page by assembling navigation, multiple content sections, and a footer.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers for prioritizing URL values, handling errors safely, and removing sensitive params from the URL hash without reload.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with class-based dark mode, content paths, and custom theme extensions for colors, typography, layout, fonts, shadows, and border radii. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Tracks the high-level project state, schema/versioning, and a catalog of implemented features for the Skyra Motoko backend and React/Vite frontend. Documents existing capabilities such as landing page sections, auth hooks, UI libraries, asset pipelines, and branding integration."
}